home buh/src/Documents/ПокупкаПродуктов/ПокупкаПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокупкаПродуктов</name>
  <basedOn>Document.ПланПокупок</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредстваНаСчетах</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеДСПоСтатьям</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВПродуктах</registerRecords>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>EnumRef.ФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОбщая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПокупкаПродуктов</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Продукты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

home buh/src/AccumulationRegisters/ПотребностьВПродуктах/ПотребностьВПродуктах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностьВПродуктах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

home buh/src/AccumulationRegisters/ДенежныеСредстваНаСчетах/ДенежныеСредстваНаСчетах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваНаСчетах</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

home buh/src/AccumulationRegisters/ДвижениеДСПоСтатьям/ДвижениеДСПоСтатьям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеДСПоСтатьям</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>EnumRef.ФизЛицо</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

home buh/src/Documents/ПокупкаПродуктов/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланПокупок") Тогда
		// Заполнение шапки
		СуммаОбщая = ДанныеЗаполнения.СуммаОбщая;
		Для Каждого ТекСтрокаПокупкаПродуктов Из ДанныеЗаполнения.ПокупкаПродуктов Цикл
			НоваяСтрока = ПокупкаПродуктов.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаПокупкаПродуктов.ЕдиницаИзмерения;
			НоваяСтрока.Итого = ТекСтрокаПокупкаПродуктов.Итого;
			НоваяСтрока.Количество = ТекСтрокаПокупкаПродуктов.Количество;
			НоваяСтрока.Наименование = ТекСтрокаПокупкаПродуктов.Наименование;
			НоваяСтрока.Цена = ТекСтрокаПокупкаПродуктов.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПотребностьВПродуктах Расход
	Движения.ПотребностьВПродуктах.Записывать = Истина;
	Для Каждого ТекСтрокаПокупкаПродуктов Из ПокупкаПродуктов Цикл
		Движение = Движения.ПотребностьВПродуктах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаПокупкаПродуктов.Наименование;
		Движение.Количество = ТекСтрокаПокупкаПродуктов.Количество;
	КонецЦикла;

	// регистр ДенежныеСредстваНаСчетах Расход
	Движения.ДенежныеСредстваНаСчетах.Записывать = Истина;
	Для Каждого ТекСтрокаПокупкаПродуктов Из ПокупкаПродуктов Цикл
		Движение = Движения.ДенежныеСредстваНаСчетах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Счет = Счет;
		Движение.Сумма = ТекСтрокаПокупкаПродуктов.Итого;
	КонецЦикла;

	// регистр ДвижениеДСПоСтатьям 
	Движения.ДвижениеДСПоСтатьям.Записывать = Истина;
	Для Каждого ТекСтрокаПокупкаПродуктов Из ПокупкаПродуктов Цикл
		Движение = Движения.ДвижениеДСПоСтатьям.Добавить();
		Движение.Период = Дата;
		Движение.ФизЛицо = ФизЛицо;
		Движение.Статья = СтатьяДвиженияДС;                                              
		Движение.Сумма = ТекСтрокаПокупкаПродуктов.Итого;
	КонецЦикла;
	
	Если Режим =  РежимПроведенияДокумента.Оперативный Тогда 
		
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредстваНаСчетахОстатки.Счет КАК Счет,
		|	ДенежныеСредстваНаСчетахОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаСчетах.Остатки(, Счет = &Счет) КАК ДенежныеСредстваНаСчетахОстатки
		|ГДЕ
		|	ДенежныеСредстваНаСчетахОстатки.СуммаОстаток < 0";
		
		Запрос.УстановитьПараметр("Счет", Счет);
	    Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			Отказ = Истина;
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщить("Недостаточно средств на "+ ВыборкаДетальныеЗаписи.Счет);
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
			КонецЦикла;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
        КонецЕсли;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаОбщая = ПокупкаПродуктов.Итог("Итого");
КонецПроцедуры
